RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csd_v2.c
    /* Disconnect all pins of current sensors */
    for(i = 0u; i < ptrActiveSns->numPins; i++)
    {
        Cy_CapSense_CSDDisconnectSns(ptrActivePin, context);
        ptrActivePin++;
    }
    ptrActive->connectedSnsState = CY_CAPSENSE_SNS_DISCONNECTED;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDConnectSns
****************************************************************************//**
*
* Connects port pin to the CSD HW block using AMUX bus.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_SetPinState() function should be used instead.
*
* This function can be used to customize the default sensor connection
* by connecting one or more pins to an existing sensor prior to initiating
* scan of the sensor.
*
* The function ignores whether the sensor is a ganged sensor and
* connects only a specified port pin to the CSD HW block. This function can
* only use GPIOs that are already assigned to CAPSENSE&trade; middleware.
*
* The functions that perform a setup and scan of a sensor/widget do not
* take into account changes in the design made by
* the Cy_CapSense_CSDConnectSns() function, hence all GPIOs connected
* using this function must be disconnected using
* the Cy_CapSense_CSDDisconnectSns() function prior to initializing
* new widgets. Use this function in StartSample
* callback (see the \ref group_capsense_callbacks section for details)
* or with low-level functions that perform a single-sensor scanning.
*
* Scanning should be completed before calling this function.
*
* \param snsAddrPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging to
* a sensor that is to be connected to the CSD HW block.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* An example of using the function to perform port pin re-connection:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_CSDConnect
*
*******************************************************************************/
void Cy_CapSense_CSDConnectSns(
                const cy_stc_capsense_pin_config_t * snsAddrPtr,
                const cy_stc_capsense_context_t * context)
{
    (void) context;
    Cy_CapSense_SsConfigPinRegisters(snsAddrPtr->pcPtr, (uint32_t)snsAddrPtr->pinNumber, CY_CAPSENSE_CSD_SCAN_PIN_DM, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDDisconnectSns
****************************************************************************//**
*
* Disconnects port pin from the CSD HW block by disconnecting it from AMUX bus.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_SetPinState() function should be used instead.
*
* This function can be used to disconnect a sensor connected
* using the Cy_CapSense_CSDConnectSns() function. In addition, this
* function can be used to customize a default sensor connection by
* disconnecting one or more already connected sensors prior to
* initiating a scan of the sensor.
*
* This function works identically to the Cy_CapSense_CSDConnectSns() function
* except it disconnects the specified port pin used by the sensor.
*
* Scanning should be completed before calling this function.
*
* \param  snsAddrPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging to
* a sensor that should be disconnected from the CSD HW block.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* An example of using the function to perform port pin re-connection:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_CSDConnect
*
*******************************************************************************/
void Cy_CapSense_CSDDisconnectSns(
                const cy_stc_capsense_pin_config_t * snsAddrPtr,
                const cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(snsAddrPtr->pcPtr, (uint32_t)snsAddrPtr->pinNumber,
                                     context->ptrInternalContext->csdInactiveSnsDm,
                                     context->ptrInternalContext->csdInactiveSnsHsiom);
    Cy_GPIO_Clr(snsAddrPtr->pcPtr, (uint32_t)snsAddrPtr->pinNumber);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDClearSensors
****************************************************************************//**
*
* Resets all the CSD sensors to the non-sampling state by sequentially
* disconnecting all the sensors from the Analog MUX bus and putting them to
* an inactive state.
*
* The function goes through all the widgets and updates appropriate bits in
* the IO HSIOM, PC and DR registers depending on the Inactive sensor connection
* parameter. DR register bits are set to zero when the Inactive sensor
* connection is Ground or Hi-Z.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDClearSensors(const cy_stc_capsense_context_t * context)
{
    uint32_t wdgtIndex;
    uint32_t snsIndex;
    uint32_t pinIndex;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_electrode_config_t * ptrSnsCfg;
    const cy_stc_capsense_pin_config_t * ptrPin;

    /* Go through all CSD widgets and configure each sensor/pin to the defined state */
    for (wdgtIndex = 0u; wdgtIndex < context->ptrCommonConfig->numWd; wdgtIndex++)
    {
        ptrWdCfg = &context->ptrWdConfig[wdgtIndex];
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            ptrSnsCfg = ptrWdCfg->ptrEltdConfig;
            /* Go through all sensors in widget */
            for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
            {
                ptrPin = ptrSnsCfg->ptrPin;
                /* Go through all pins in sensor */
                for(pinIndex = 0u; pinIndex < ptrSnsCfg->numPins; pinIndex++)
                {
                    /* Set CSD pin default state */
                    Cy_CapSense_CSDDisconnectSns(ptrSnsCfg->ptrPin, context);
                    ptrPin++;
                }
                ptrSnsCfg++;
            }
        }
    }
}


