RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csd_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_CSDSetWidgetSenseClkSrc
****************************************************************************//**
*
* Sets a source for the sense clock for a widget.
*
* \param ptrWdConfig
* The pointer to the widget context structure.
*
*******************************************************************************/
void Cy_CapSense_CSDSetWidgetSenseClkSrc(const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t lfsrSize;
    uint32_t conversionsNum;
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;
    #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        uint32_t rowLfsrSize;
        uint8_t widgetType = ptrWdConfig->wdType;
    #endif

    if (0u != (ptrWdCxt->snsClkSource & CY_CAPSENSE_CLK_SOURCE_AUTO_MASK))
    {
        conversionsNum = Cy_CapSense_CSDGetNumberOfConversions((uint32_t)ptrWdCxt->snsClk, (uint32_t)ptrWdCxt->resolution, CY_CAPSENSE_CLK_SOURCE_DIRECT);
        lfsrSize = Cy_CapSense_SsCalcLfsrSize((uint32_t)ptrWdCxt->snsClk, conversionsNum);
        if (CY_CAPSENSE_CLK_SOURCE_DIRECT == lfsrSize)
        {
            lfsrSize = Cy_CapSense_CSDCalcPrsSize((uint32_t)ptrWdCxt->snsClk << 1uL, (uint32_t)ptrWdCxt->resolution);
        }

        #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
            if (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == widgetType) || ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == widgetType))
            {
                if (ptrWdCxt->rowSnsClk != ptrWdCxt->snsClk)
                {
                    conversionsNum = Cy_CapSense_CSDGetNumberOfConversions((uint32_t)ptrWdCxt->rowSnsClk, (uint32_t)ptrWdCxt->resolution, CY_CAPSENSE_CLK_SOURCE_DIRECT);
                    rowLfsrSize = Cy_CapSense_SsCalcLfsrSize((uint32_t)ptrWdCxt->rowSnsClk, conversionsNum);
                    if (CY_CAPSENSE_CLK_SOURCE_DIRECT == rowLfsrSize)
                    {
                        rowLfsrSize = Cy_CapSense_CSDCalcPrsSize((uint32_t)ptrWdCxt->rowSnsClk << 1uL, (uint32_t)ptrWdCxt->resolution);
                    }
                    /* Select sense clock source based on both dimensions */
                    if (rowLfsrSize != lfsrSize)
                    {
                        lfsrSize = CY_CAPSENSE_CLK_SOURCE_DIRECT;
                    }
                }
            }
        #endif
        ptrWdCxt->snsClkSource = (uint8_t)lfsrSize | CY_CAPSENSE_CLK_SOURCE_AUTO_MASK;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDCalcPrsSize
****************************************************************************//**
*
* The function finds PRS polynomial size when clock source is set to Auto mode.
*
* The PRS polynomial size in the Auto mode is found based on the following
* requirements:
* - at least one full spread spectrum polynomial should pass during scan time.
*
* \param snsClkDivider
* The divider value for the sense clock.
*
* \param resolution
* The widget resolution.
*
* \return
* Returns the size of PRS value for SENSE_PERIOD register.
*
*******************************************************************************/
uint32_t Cy_CapSense_CSDCalcPrsSize(uint32_t snsClkDivider, uint32_t resolution)
{
    uint32_t prsSize;

    if ((snsClkDivider * CY_CAPSENSE_PRS_LENGTH_12_BITS) <= ((0x00000001uL << resolution) - 1u))
    {
        /* Set PRS12 mode */
        prsSize = CY_CAPSENSE_CLK_SOURCE_PRS12;
    }
    else if ((snsClkDivider * CY_CAPSENSE_PRS_LENGTH_8_BITS) <= ((0x00000001uL << resolution) - 1u))
    {
        /* Set PRS8 mode */
        prsSize = CY_CAPSENSE_CLK_SOURCE_PRS8;
    }
    else
    {
        prsSize = CY_CAPSENSE_CLK_SOURCE_DIRECT;
    }

    return prsSize;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDDischargeCmod
****************************************************************************//**
*
* Discharges Cmod capacitor related to CSD sensing method and restores
* it state.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDDischargeCmod(cy_stc_capsense_context_t * context)
{
    en_hsiom_sel_t hsiomReg;
    uint32_t pcReg;
    uint32_t  interruptState;

    /* Disconnect Ext Cap from AMUXBUS-A / AMUXBUSB using HSIOM registers */
    interruptState = Cy_SysLib_EnterCriticalSection();
    hsiomReg = Cy_GPIO_GetHSIOM(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod);
    Cy_GPIO_SetHSIOM(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod,
                                                            CY_CAPSENSE_HSIOM_SEL_GPIO);
    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Set port configuration register (drive mode) to STRONG mode */
    interruptState = Cy_SysLib_EnterCriticalSection();
    pcReg = Cy_GPIO_GetDrivemode(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod);
    Cy_GPIO_Clr(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod);
    Cy_GPIO_SetDrivemode(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF);
    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Now external CSD-related capacitors discharging */
    Cy_SysLib_DelayUs(CY_CAPSENSE_EXT_CAP_DISCHARGE_TIME);

    /* Restore Ext Cap settings */
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetDrivemode(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, pcReg);
    Cy_GPIO_SetHSIOM(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, hsiomReg);
    Cy_SysLib_ExitCriticalSection(interruptState);
}


#if((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) && \
    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CSDNormalizeIdac
****************************************************************************//**
*
* This function normalizes compensation IDAC.
*
* \param ptrWdConfig
* Specifies the pointer to a widget configuration structure.
*
* \param target
* Raw count target in percentage.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDNormalizeIdac(
                cy_stc_capsense_widget_config_t const * ptrWdConfig,
                uint32_t target,
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    uint32_t maxIdac;
    uint32_t minIdac;
    uint32_t minRaw;
    uint32_t rawLevel;
    uint32_t iMod;

