RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csd_v2.c
    uint32_t freqChIndex;

    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;
    uint32_t maxRawLevel = ptrWdCxt->maxRawCount;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    for(freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
    {
        /* Find maximum and minimum IDACs */
        maxIdac = ptrWdConfig->ptrWdContext->idacMod[freqChIndex];
        minIdac = maxIdac;
        ptrSnsCxt = &ptrWdConfig->ptrSnsContext[freqChIndex * context->ptrCommonConfig->numSns];
        minRaw = ptrSnsCxt->raw;
        for(snsIndex = 0u; snsIndex < ptrWdConfig->numCols; snsIndex++)
        {
            if (minIdac > ptrSnsCxt->idacComp)
            {
                minIdac = ptrSnsCxt->idacComp;
                minRaw = ptrSnsCxt->raw;
            }
            ptrSnsCxt++;
        }

        /* Define new modulator IDAC */
        rawLevel = ((minRaw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) + CY_CAPSENSE_PERCENTAGE_100;
        iMod = (rawLevel * minIdac) / target;

        if (iMod > maxIdac)
        {
            iMod = maxIdac;
        }
        ptrWdCxt->idacMod[freqChIndex] = (uint8_t)iMod;

        /* Re-calculate compensation IDAC */
        ptrSnsCxt = &ptrWdConfig->ptrSnsContext[freqChIndex * context->ptrCommonConfig->numSns];
        for(snsIndex = 0u; snsIndex < ptrWdConfig->numCols; snsIndex++)
        {
            rawLevel = ((((uint32_t)ptrSnsCxt->raw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) +
                CY_CAPSENSE_PERCENTAGE_100) * ptrSnsCxt->idacComp;
            if (rawLevel < (iMod * target))
            {
                ptrSnsCxt->idacComp = 0u;
            }
            else
            {
                ptrSnsCxt->idacComp = (uint8_t)(((rawLevel - (iMod * target)) +
                    (CY_CAPSENSE_PERCENTAGE_100 >> 1u)) / CY_CAPSENSE_PERCENTAGE_100);
            }
            ptrSnsCxt++;
        }
        /* IDAC Normalization is performed separately for row and column  */
        #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
            if (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdConfig->wdType) ||
                ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdConfig->wdType))
            {
                /* Find maximum and minimum IDACs */
                maxIdac = ptrWdCxt->rowIdacMod[freqChIndex];
                minIdac = ptrWdCxt->rowIdacMod[freqChIndex];
                ptrSnsCxt = &(ptrWdConfig->ptrSnsContext[(freqChIndex * context->ptrCommonConfig->numSns) + ptrWdConfig->numCols]);
                minRaw = ptrSnsCxt->raw;
                for(snsIndex = ptrWdConfig->numCols; snsIndex < ptrWdConfig->numSns; snsIndex++)
                {
                    if (minIdac > ptrSnsCxt->idacComp)
                    {
                        minIdac = ptrSnsCxt ->idacComp;
                        minRaw = ptrSnsCxt->raw;
                    }
                    ptrSnsCxt++;
                }

                /* Define new modulator IDAC */
                rawLevel = ((minRaw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) + CY_CAPSENSE_PERCENTAGE_100;
                iMod = (rawLevel * minIdac) / target;

                if (iMod > maxIdac)
                {
                    iMod = maxIdac;
                }
                ptrWdCxt->rowIdacMod[freqChIndex] = (uint8_t)iMod;

                /* Re-calculate compensation IDAC */
                ptrSnsCxt = &(ptrWdConfig->ptrSnsContext[(freqChIndex * context->ptrCommonConfig->numSns) + ptrWdConfig->numCols]);
                for(snsIndex = 0u; snsIndex < ptrWdConfig->numCols; snsIndex++)
                {
                    rawLevel = ((((uint32_t)ptrSnsCxt->raw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) +
                        CY_CAPSENSE_PERCENTAGE_100) * ptrSnsCxt->idacComp;
                    if (rawLevel < (iMod * target))
                    {
                        ptrSnsCxt->idacComp = 0u;
                    }
                    else
                    {
                        ptrSnsCxt->idacComp = (uint8_t)(((rawLevel - (iMod * target)) +
                            (CY_CAPSENSE_PERCENTAGE_100 >> 1u)) / CY_CAPSENSE_PERCENTAGE_100);
                    }
                    ptrSnsCxt++;
                }
            }
        #endif /* ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN)) */
    }
}
#endif

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN)
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_AUTO_GAIN_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_SsCSDSwitchIdacGain
****************************************************************************//**
*
* Switches to the lower IDAC gain is possible.
*
* This internal function switches to the lower IDAC gain is possible.
* Conditions of switching to the lower IDAC gains:
* 1. The current IDAC gain is not the lowest one.
* 2. The maximum IDAC at gain switching will not be out of range.
* 3. The minimum IDAC is still below the acceptable range.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return Returns the status of the operation:
* - Zero     - Gain switching is not needed.
* - Non-Zero - Gain was switched to the lower one.
*
*******************************************************************************/
static uint32_t Cy_CapSense_CSDSwitchIdacGain(cy_stc_capsense_context_t * context)
{
    uint32_t ratio;
    uint32_t maxIdac;
    uint32_t minIdac;
    uint32_t swStatus = 0u;
    const cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    uint32_t gainIndex = ptrActive->ptrWdContext->idacGainIndex;
    uint32_t idacVal;
    uint32_t freqChIndex;

    maxIdac = 0u;
    minIdac = CY_CAPSENSE_CAL_IDAC_MAX_VALUE;

    #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
        const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
        uint32_t snsIndex;
    #endif

