RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csd_v2.c
        isBusyWatchdogTimeUs *= CY_CAPSENSE_CSD_WATCHDOG_MARGIN_COEFF;

        do
        {
            /* Need to configure the CSD HW block with each IDAC change */
            Cy_CapSense_CSDSetupWidgetExt(widgetId, snsIndex, context);
            /* Need to discharge Cmod capacitor */
            Cy_CapSense_CSDDischargeCmod(context);
            /* Scan the sensor */
            Cy_CapSense_CSDScanExt(context);

            cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
            watchdogCounter = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

            /* Wait for EOS */
            while (CY_CAPSENSE_BUSY == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
            {
                if(0uL == watchdogCounter)
                {
                    break;
                }
                watchdogCounter--;
            }

            /* Switch to the lower IDAC mask */
            for(freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
            {
                /* Update IDAC based on scan result */
                if (ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].raw < rawTarget)
                {
                    ptrIdacMod[freqChIndex] &= (uint8_t)(~calMask);
                }

                ptrIdacMod[freqChIndex] |= (uint8_t)(calMask >> 1u);

                if(0u == ptrIdacMod[freqChIndex])
                {
                    ptrIdacMod[freqChIndex] = 1u;
                }
                #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
                    ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].idacComp = ptrIdacMod[freqChIndex];
                #endif
            }
            calMask >>= 1u;
        }
        while(calMask != 0u);

        for(freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
        {
            /* Set the max Idac value */
            if (ptrIdacMax[freqChIndex] < ptrIdacMod[freqChIndex])
            {
                ptrIdacMax[freqChIndex] = ptrIdacMod[freqChIndex];
            }
        }

        /* Perform scan again to get real raw count if IDAC was changed last iteration */
        Cy_CapSense_CSDSetupWidgetExt(widgetId, snsIndex, context);
        Cy_CapSense_CSDScanExt(context);

        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

        /* Wait for EOS */
        while (CY_CAPSENSE_BUSY == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
        {
            if(0uL == watchdogCounter)
            {
                break;
            }
            watchdogCounter--;
        }
    }

    for(freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
    {
        ptrWdCxt->idacMod[freqChIndex] = maxColIdac[freqChIndex];

        #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
            if (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType) ||
                ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType))
            {
                ptrWdCxt->rowIdacMod[freqChIndex] = maxRowIdac[freqChIndex];

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_ROW_COL_ALIGN_EN)
                    if (((uint32_t)ptrWdCxt->idacMod[freqChIndex] * ptrWdCxt->snsClk) <
                        ((uint32_t)ptrWdCxt->rowIdacMod[freqChIndex] * ptrWdCxt->rowSnsClk))
                    {
                        tmpVal = ((uint32_t)ptrWdCxt->rowIdacMod[freqChIndex] * ptrWdCxt->rowSnsClk) / ptrWdCxt->snsClk;
                        if (tmpVal > CY_CAPSENSE_CAL_IDAC_MAX_VALUE)
                        {
                            tmpVal = CY_CAPSENSE_CAL_IDAC_MAX_VALUE;
                        }
                        ptrWdCxt->idacMod[freqChIndex] = (uint8_t)tmpVal;
                    }
                    else
                    {
                        tmpVal = ((uint32_t)ptrWdCxt->idacMod[freqChIndex] * ptrWdCxt->snsClk) / ptrWdCxt->rowSnsClk;
                        if (tmpVal > CY_CAPSENSE_CAL_IDAC_MAX_VALUE)
                        {
                            tmpVal = CY_CAPSENSE_CAL_IDAC_MAX_VALUE;
                        }
                        ptrWdCxt->rowIdacMod[freqChIndex] = (uint8_t)tmpVal;
                    }
            #endif
            }
        #endif /* ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN)) */
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDCalibrateWidget
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in the widget specified in
* the input.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_CalibrateWidget() function should be used instead.
*
* Performs a successive approximation search algorithm to find appropriate
* modulator and compensation IDAC (if enabled) values for all sensors in
* the specified widget that provide the raw count to the level
* specified by the target parameter.
*
* Calibration returns CY_CAPSENSE_STATUS_BAD_DATA if the achieved raw count is outside
* of the range specified by the target and acceptable calibration deviation
* parameters.
*
* This function could be used when the CSD Enable IDAC auto-calibration
* parameter is enabled. Do not use this function when
* the smart sensing algorithm auto-tuning mode is configured.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* Specifies the calibration target in percentages of the maximum raw count.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget calibration:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_BAD_DATA      - The calibration failed and CAPSENSE&trade; may not operate
*                          as expected.
* - CY_CAPSENSE_STATUS_INVALID_STATE - The previous scanning is not completed, and
*                         the CAPSENSE&trade; middleware is busy.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CSDCalibrateWidget(
                uint32_t widgetId,
                uint32_t target,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;
    uint32_t modClkDivider;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_AUTO_GAIN_EN)
        uint32_t gainSwitch;
    #endif

    /* Approximate duration of Wait For Init loop */
    const uint32_t isBusyLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    uint64_t isBusyWatchdogTimeUs;

