RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csd_v2.c
    if (0u == watchdogCounter)
    {
        /* Set sequencer to idle state if coarse initialization fails */
        context->ptrCommonConfig->ptrCsdBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDTriggerScan
****************************************************************************//**
*
* Triggers the scanning.
*
* This function trigger the fine initialization (scan some dummy cycles) and
* start sampling.
* For the fine initialization and sampling, Cmod is statically connected to
* AMUXBUS-A and in every conversion (one cycle of SnsClk), the sensor
* capacitance is charged from Cmod and discharged to ground using the
* switches in GPIO cell. The CSDCOMP monitors voltage on Cmod using the
* sense path and charges Cmod back to Vref using IDACs by connecting IDAC
* to CSDBUS-A and then the AMUXBUS-A.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDTriggerScan(cy_stc_capsense_context_t * context)
{
    /* Clear previous interrupts */
    context->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)context->ptrCommonConfig->ptrCsdBase->INTR;

    /* Enable SAMPLE interrupt */
    context->ptrCommonConfig->ptrCsdBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_SAMPLE_MSK;
    context->ptrCommonConfig->ptrCsdBase->SW_HS_P_SEL = context->ptrInternalContext->csdRegSwHsPSelScan;

    /* Set scanning configuration for switches */
    context->ptrCommonConfig->ptrCsdBase->SW_FW_MOD_SEL = 0u;
    context->ptrCommonConfig->ptrCsdBase->SW_FW_TANK_SEL = 0u;
    context->ptrCommonConfig->ptrCsdBase->SW_SHIELD_SEL = context->ptrInternalContext->csdRegSwShieldSelScan;

    context->ptrCommonConfig->ptrCsdBase->SW_RES = context->ptrInternalContext->csdRegSwResScan;
    context->ptrCommonConfig->ptrCsdBase->HSCMP = context->ptrInternalContext->csdRegHscmpScan;

    /* Force the LFSR to it's initial state (all ones) */
    context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD =
            context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD |
            CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_CLEAR_MSK | CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_BITS_MSK;

    /* Start SEQUENCER for fine initialization scan for Cmod and then for normal scan */
    context->ptrCommonConfig->ptrCsdBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_AZ0_SKIP_MSK |
                                                      CY_CAPSENSE_CSD_SEQ_START_AZ1_SKIP_MSK |
                                                      CY_CAPSENSE_CSD_SEQ_START_START_MSK;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDScanISR
****************************************************************************//**
*
* This is an internal ISR function to handle the CSD sensing method operation.
*
* This handler covers the following functionality:
* - Read the result of the measurement and store it into the corresponding
*   register of the data structure.
* - If the Noise Metric functionality is enabled, then check the number of bad
*   conversions and repeat the scan of the current sensor of the number of bad
*   conversions is greater than the Noise Metric Threshold.
* - Initiate the scan of the next sensor for multiple sensor scanning mode.
* - Update the status register in the data structure.
* - Switch the CSD HW block to the default state if scanning of all the sensors is
*   completed.
*
* This is an internal ISR function for the single-sensor scanning implementation.
*
* \param capsenseContext
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDScanISR(void * capsenseContext)
{
    uint32_t rawData;
    uint32_t maxCount;
    cy_stc_capsense_context_t * cxt = (cy_stc_capsense_context_t *)capsenseContext;
    const cy_stc_active_scan_sns_t * ptrActive = cxt->ptrActiveScanSns;

    /* Clear pending interrupt */
    cxt->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)cxt->ptrCommonConfig->ptrCsdBase->INTR;

    /* Open HCBV and HCBG switches */
    cxt->ptrCommonConfig->ptrCsdBase->SW_SHIELD_SEL = 0u;

    /* Save raw count */
    maxCount = (1uL << ptrActive->ptrWdContext->resolution) - 1uL;
    rawData = cxt->ptrCommonConfig->ptrCsdBase->RESULT_VAL1 & CY_CAPSENSE_CSD_RESULT_VAL1_VALUE_MSK;

    if(rawData > maxCount)
    {
        rawData = maxCount;
    }
    ptrActive->ptrSnsContext->raw = (uint16_t)rawData;
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
        /* Either complete scan or initiate new one */
        if (ptrActive->mfsChannelIndex < CY_CAPSENSE_MFS_CH2_INDEX)
        {
            Cy_CapSense_CSDInitNextChScan(cxt);
        }
        else if (CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS == ptrActive->scanScope)
        {
            Cy_CapSense_ClrBusyFlags(cxt);
        }
        else
        {
            /* Disable sensor */
            Cy_CapSense_CSDDisconnectSnsExt(cxt);
            /* Scan the next sensor */
            Cy_CapSense_CSDInitNextSnsScan(cxt);
        }
    #else
        if (CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS == ptrActive->scanScope)
        {
            Cy_CapSense_ClrBusyFlags(cxt);
        }
        else
        {
            /* Disable sensor */
            Cy_CapSense_CSDDisconnectSnsExt(cxt);
            /* Scan the next sensor */
            Cy_CapSense_CSDInitNextSnsScan(cxt);
        }
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDInitNextSnsScan
****************************************************************************//**
*
* This function initializes the next sensor scan.
*
* The function increments the sensor index, updates sense clock for matrix
* or touchpad widgets only, sets up Compensation IDAC, enables the sensor and
* scans it. When all the sensors are scanned it continues to set up the next
* widget until all the widgets are scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDInitNextSnsScan(cy_stc_capsense_context_t * context)
{
    const cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    uint32_t sensorId = ptrActive->sensorIndex + 1uL;

    /* Check if all the sensors are scanned in widget */
    if (ptrActive->ptrWdConfig->numSns > sensorId)
    {
        /* Switch to the next sensor */
        Cy_CapSense_InitActivePtrSns(sensorId, context);

